// © Copyright 2004-2010, 2015 HP Development Company, L.P.

TaskName = "Firmware bijwerken";

// Errors
FileOpenError = "Kan bestand %@ niet openen.";
FileOpenErrorExplanation = "Dit bestand is beschadigd, verplaatst of verwijderd of heeft een nieuwe naam gekregen. Controleer de locatie van het bestand of selecteer een ander bestand en probeer het opnieuw.";
PrintChannelOpenError = "Kan geen printerkanaal openen";
PrintChannelOpenErrorExplanation = "Controleer of de printer aanstaat en is verbonden. Probeer het vervolgens opnieuw.";
SendDataError = "Kan geen gegevens naar de printer sturen";
SendDataErrorExplanation = "Controleer of de printer aanstaat en is verbonden. Probeer het vervolgens opnieuw.";

SomePenErrorTitle = "Kan firmware niet bijwerken";
DoorOpenMsg = "Kan firmware niet bijwerken omdat een klep is geopend. Sluit alle kleppen van de printer.";

// Aquamarine Errors
FileCheckError = "Kan firmware niet bijwerken";
FileCheckErrorExplanation = "Ongeldig firmwarepakket. Selecteer een ander bestand en probeer het opnieuw.";

OkButton = "OK";
CancelButton = "Annuleer";
FirmwareUpdateTitle = "Firmware-update";
FirmwareUpdateDeviceState = "Bezig met afdrukken";
FirmwareUpdateCancelingDeviceState = "Bezig met annuleren";

// Great Wall Messages
PrinterIdleWarning = "De firmware-update kan mislukken als uw printer met iets bezig is (bijvoorbeeld met een afdruktaak of kalibratie).\n\nControleer of uw printer inactief is voordat u begint met het bijwerken van de firmware.";
UpdateSuccessful = "Het firmwarebestand is naar de printer gekopieerd en de printer wordt zo meteen bijgewerkt.\n\nNa voltooiing van de firmware-update wordt uw printer automatisch opnieuw opgestart.";
InvalidPackage = "Er zijn problemen met het firmwarebestand en de firmware-update is niet voltooid. Het probleem is wellicht veroorzaakt door een transmissiefout.\n\nBegin de firmware-update van voren af aan.\nAls het probleem aanhoudt, neemt u contact op met de ondersteuning van HP.";
FailedDependencies = "De firmware-update kan niet worden bijgewerkt vanwege een probleem met afhankelijkheden.\n\nDe huidige firmwareversie is %@ en u probeert %@ te installeren.\n\nVind op onderstaande webpagina het geschikte updatepakket voor deze printer:\n%@.";
NotNow = "De firmware-update is mislukt omdat uw printer met iets bezig is (bijvoorbeeld met het verwerken of afdrukken van een taak).\n\nControleer of uw printer inactief is voordat u opnieuw begint met het bijwerken van de firmware.";
TransmissionError = "Er zijn enkele problemen met de transmissie waardoor de firmware-update niet is geslaagd.\n\nControleer de printerverbinding en voer de firmware-update opnieuw uit.";
LicenseNotAccepted = "De firmware-update is niet uitgevoerd omdat de licentie niet is geaccepteerd.";
FatalError = "Er zijn problemen waardoor de firmware-update niet is geslaagd.\n\nAls het probleem aanhoudt, neemt u contact op met de ondersteuning van HP.";

// layout
TaskTitle = "Firmware bijwerken";
TaskDescription = "Selecteer een bestand met een firmware-update en stuur dat bestand naar de printer om de printer bij te werken.";
FileNameTitle = "Naam bestand:";
FileNameField = "<Niet geselecteerd>";
ChooseButton = "Kies…";
UpdateButton = "Werk bij";
ProgressPanel = "Voortgang van update";
FirmwareUpdateProcessTitle = "Bezig met bijwerken…";
